// console.info працює аналогічно console.log, але її вивід класифікується як інформативний, а не лОговий
console.info("Інформація");

// console.warn працює аналогічно console.log, але її вивід класифікується як попередження, а не лог
console.warn("Попередження");

// console.error працює аналогічно console.log, але її вивід класифікується як помилка, а не лог
console.error("Помилка");

// console.dir виводить властивості переданого об'єкта у вигляді дерева
console.dir(top);

// console.dirxml виводить ієрархічне дерево починаючи з переданого XML/HTML елемента
console.dirxml(document.documentElement);

// console.time запускає таймер; переданий текст використовується для позначення запущеного таймеру
console.time("Таймер 1");

setTimeout(() => {
    // console.timeEnd зупиняє таймер і виводить час, що пройшов з моменту запуска таймера
    console.timeEnd("Таймер 1");
}, 325);

// console.profile починає запис профілю роботи веб-сторінки;
// профіль показує які фукнції були викликані і коли, а також скільки часу вони виконувалися
console.profile("Профіль 1");

// console.profileEnd завершує запис профілю і дозволяє його переглянути
console.profileEnd("Профіль 1");

// console.assert перевіряє умову і виводить помилку, якщо умова хибна
console.assert(false, "Помилка!");

